# MassDataPercentageGlazing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassDataPercentageGlazing Property
ParameterTypeId Class See Also
---
"Target Percentage Glazing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassDataPercentageGlazing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDataPercentageGlazing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDataPercentageGlazing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace